Revit 2027 API
BasePoint.GetSurveyPoint Method
 Gets the survey point for the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static BasePoint GetSurveyPoint(
	Document cda
)
Public Shared Function GetSurveyPoint (
	cda As Document
) As BasePoint
public:
static BasePoint^ GetSurveyPoint(
	Document^ cda
)
static member GetSurveyPoint :
        cda : Document -> BasePoint
Parameters
cda Document
 The document from which to get the survey point.
Return Value
BasePoint
 The survey point of the document.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
BasePoint Class
Autodesk.Revit.DB Namespace